Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_ef_ctrl.c
  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_CFG_0);

  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EF_DATA_0_EF_SBOOT_SIGN_MODE, sign[0]);

  if (aes[0] != EF_CTRL_SF_AES_NONE) {
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EF_DATA_0_EF_SF_AES_MODE, aes[0]);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, EF_DATA_0_EF_CPU0_ENC_EN, 1);
  }

  BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_CFG_0, tmpVal);

  if (program) {
    EF_Ctrl_Program_Efuse_0();
  }
}

/****************************************************************************
 * @brief  Efuse write security boot configuration
 *
 * @param  sign[1]: Sign configuration pointer
 * @param  aes[1]: AES configuration pointer
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Read_Secure_Boot(EF_Ctrl_Sign_Type sign[1], EF_Ctrl_SF_AES_Type aes[1]) {
  uint32_t tmpVal;
  uint32_t tmpVal2;

  /* Trigger read data from efuse */
  EF_CTRL_LOAD_BEFORE_READ_R0;

  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_CFG_0);

  tmpVal2 = BL_GET_REG_BITS_VAL(tmpVal, EF_DATA_0_EF_SBOOT_SIGN_MODE);
  sign[0] = (EF_Ctrl_Sign_Type)(tmpVal2 & 0x01);

  tmpVal2 = BL_GET_REG_BITS_VAL(tmpVal, EF_DATA_0_EF_CPU0_ENC_EN);

  if (tmpVal2) {
    aes[0] = (EF_Ctrl_SF_AES_Type)BL_GET_REG_BITS_VAL(tmpVal, EF_DATA_0_EF_SF_AES_MODE);
  } else {
    aes[0] = EF_CTRL_SF_AES_NONE;
  }
}

/****************************************************************************
 * @brief  Analog Trim parity calculate
 *
 * @param  val: Value of efuse trim data
 * @param  len: Length of bit to calculate
 *
 * @return Parity bit value
 *
 *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
uint8_t ATTR_CLOCK_SECTION EF_Ctrl_Get_Trim_Parity(uint32_t val, uint8_t len) {
  uint8_t cnt = 0;
  uint8_t i   = 0;

  for (i = 0; i < len; i++) {
    if (val & (1 << i)) {
      cnt++;
    }
  }

  return cnt & 0x01;
}
#endif

/****************************************************************************
 * @brief  Efuse write analog trim
 *
 * @param  index: index of analog trim
 * @param  trim: trim value
 * @param  program: program to efuse entity or not
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Write_Ana_Trim(uint32_t index, uint32_t trim, uint8_t program) {
  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  if (index == 0) {
    BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_ANA_TRIM_0, trim);
  }

  if (program) {
    EF_Ctrl_Program_Efuse_0();
  }
}

/****************************************************************************
 * @brief  Efuse read analog trim
 *
 * @param  index: index of analog trim
 * @param  trim: trim value
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Read_Ana_Trim(uint32_t index, uint32_t *trim) {
  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  EF_CTRL_LOAD_BEFORE_READ_R0;

  if (index == 0) {
    *trim = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_ANA_TRIM_0);
  }
}

/****************************************************************************
 * @brief  Efuse read RC32M trim
 *
 * @param  trim: Trim data pointer
 *
 * @return None
 *
 *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_CLOCK_SECTION EF_Ctrl_Read_RC32M_Trim(Efuse_Ana_RC32M_Trim_Type *trim) {
  uint32_t tmpVal = 0;
  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  EF_CTRL_LOAD_BEFORE_READ_R0;

  tmpVal                         = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_ANA_TRIM_0);
  trim->trimRc32mCodeFrExt       = (tmpVal >> 10) & 0xff;
  trim->trimRc32mCodeFrExtParity = (tmpVal >> 18) & 0x01;
  trim->trimRc32mExtCodeEn       = (tmpVal >> 19) & 0x01;
}
#endif

/****************************************************************************
 * @brief  Efuse read RC32K trim
 *
 * @param  trim: Trim data pointer
 *
 * @return None
 *
 *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_CLOCK_SECTION EF_Ctrl_Read_RC32K_Trim(Efuse_Ana_RC32K_Trim_Type *trim) {
  uint32_t tmpVal = 0;
  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  EF_CTRL_LOAD_BEFORE_READ_R0;

  tmpVal                         = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_ANA_TRIM_0);
  trim->trimRc32kCodeFrExt       = (tmpVal >> 20) & 0x3ff;
  trim->trimRc32kCodeFrExtParity = (tmpVal >> 30) & 0x01;
  trim->trimRc32kExtCodeEn       = (tmpVal >> 31) & 0x01;
}
#endif

/****************************************************************************
 * @brief  Efuse read TSEN trim
 *
 * @param  trim: Trim data pointer
 *
 * @return None
 *
 *******************************************************************************/
void ATTR_CLOCK_SECTION EF_Ctrl_Read_TSEN_Trim(Efuse_TSEN_Refcode_Corner_Type *trim) {
  uint32_t tmpVal = 0;
  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  EF_CTRL_LOAD_BEFORE_READ_R0;

  tmpVal                    = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W3);
  trim->tsenRefcodeCornerEn = tmpVal & 0x01;

  tmpVal                        = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_LOCK);
  trim->tsenRefcodeCorner       = tmpVal & 0xfff;
  trim->tsenRefcodeCornerParity = (tmpVal >> 12) & 0x01;

  trim->tsenRefcodeCornerVersion = 0;
}

/****************************************************************************
 * @brief  Efuse read ADC Gain trim
 *
 * @param  trim: Trim data pointer
 *
 * @return None
 *
 *******************************************************************************/
void ATTR_CLOCK_SECTION EF_Ctrl_Read_ADC_Gain_Trim(Efuse_ADC_Gain_Coeff_Type *trim) {
  uint32_t tmpVal = 0;
  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  EF_CTRL_LOAD_BEFORE_READ_R0;

  tmpVal                   = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W3);
  trim->adcGainCoeff       = (tmpVal >> 1) & 0xfff;
  trim->adcGainCoeffParity = (tmpVal >> 13) & 0x01;
  trim->adcGainCoeffEn     = (tmpVal >> 14) & 0x01;
}

/****************************************************************************
 * @brief  Efuse write software usage
 *
 * @param  index: index of software usage
 * @param  usage: usage value
 * @param  program: program to efuse entity or not
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Write_Sw_Usage(uint32_t index, uint32_t usage, uint8_t program) {
  /* switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  if (index == 0) {
    BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_SW_USAGE_0, usage);
  }

