Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_ef_ctrl.c
  if (program) {
    EF_Ctrl_Program_Efuse_0();
  }
}

/****************************************************************************
 * @brief  Efuse read software usage
 *
 * @param  index: index of software usage
 * @param  usage: usage value
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Read_Sw_Usage(uint32_t index, uint32_t *usage) {
  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  EF_CTRL_LOAD_BEFORE_READ_R0;

  if (index == 0) {
    *usage = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_SW_USAGE_0);
  }
}

/****************************************************************************
 * @brief  Efuse read software usage
 *
 * @param  index: index of software usage
 * @param  program: usage value
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Writelock_Sw_Usage(uint32_t index, uint8_t program) {
  uint32_t tmpVal;

  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_LOCK);

  if (index == 0) {
    tmpVal = BL_SET_REG_BIT(tmpVal, EF_DATA_0_WR_LOCK_SW_USAGE_0);
  }

  BL_WR_REG(EF_DATA_BASE, EF_DATA_0_LOCK, tmpVal);

  if (program) {
    EF_Ctrl_Program_Efuse_0();
  }
}

/****************************************************************************
 * @brief  Efuse write MAC address
 *
 * @param  mac[6]: MAC address buffer
 * @param  program: program to efuse entity or not
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Write_MAC_Address(uint8_t mac[6], uint8_t program) {
  uint8_t *maclow  = (uint8_t *)mac;
  uint8_t *machigh = (uint8_t *)(mac + 4);
  uint32_t tmpVal;

  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  /* The low 32 bits */
  BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_WIFI_MAC_LOW, BL_RDWD_FRM_BYTEP(maclow));
  /* The high 16 bits */
  tmpVal = machigh[0] + (machigh[1] << 8);
  BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_WIFI_MAC_HIGH, tmpVal);

  if (program) {
    EF_Ctrl_Program_Efuse_0();
  }
}

/****************************************************************************
 * @brief  Efuse Ctrl get zero bit count
 *
 * @param  val: Value to count
 *
 * @return Zero bit count
 *
 *******************************************************************************/
static uint32_t EF_Ctrl_Get_Byte_Zero_Cnt(uint8_t val) {
  uint32_t cnt = 0;
  uint32_t i   = 0;

  for (i = 0; i < 8; i++) {
    if ((val & (1 << i)) == 0) {
      cnt += 1;
    }
  }

  return cnt;
}

/****************************************************************************
 * @brief  Efuse read MAC address
 *
 * @param  mac[8]: MAC address buffer
 *
 * @return SUCCESS or ERROR
 *
 *******************************************************************************/
BL_Err_Type EF_Ctrl_Read_MAC_Address(uint8_t mac[8]) {
  uint8_t *maclow  = (uint8_t *)mac;
  uint8_t *machigh = (uint8_t *)(mac + 4);
  uint32_t tmpVal;
  uint32_t i   = 0;
  uint32_t cnt = 0;

  /* Trigger read data from efuse */
  EF_CTRL_LOAD_BEFORE_READ_R0;

  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_WIFI_MAC_LOW);
  BL_WRWD_TO_BYTEP(maclow, tmpVal);

  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_WIFI_MAC_HIGH);
  BL_WRWD_TO_BYTEP(machigh, tmpVal);

  /* Get original parity */
  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W2);

  /* Check parity */
  for (i = 0; i < 8; i++) {
    cnt += EF_Ctrl_Get_Byte_Zero_Cnt(mac[i]);
  }

  if ((cnt & 0x3f) == (tmpVal & 0x3f)) {
    return SUCCESS;
  } else {
    return ERROR;
  }
}

/****************************************************************************
 * @brief  Efuse read MAC address
 *
 * @param  mac[7]: MAC address buffer
 *
 * @return SUCCESS or ERROR
 *
 *******************************************************************************/
BL_Err_Type EF_Ctrl_Read_MAC_Address_Raw(uint8_t mac[7]) {
  uint8_t *maclow  = (uint8_t *)mac;
  uint8_t *machigh = (uint8_t *)(mac + 4);
  uint32_t tmpVal;

  /* Trigger read data from efuse */
  EF_CTRL_LOAD_BEFORE_READ_R0;

  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_WIFI_MAC_LOW);
  BL_WRWD_TO_BYTEP(maclow, tmpVal);

  tmpVal     = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_WIFI_MAC_HIGH);
  machigh[0] = tmpVal & 0xff;
  machigh[1] = (tmpVal >> 8) & 0xff;
  machigh[2] = (tmpVal >> 16) & 0xff;

  return SUCCESS;
}

/****************************************************************************
 * @brief  Efuse lock writing for MAC address
 *
 * @param  program: program to efuse entity or not
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Writelock_MAC_Address(uint8_t program) {
  uint32_t tmpVal;

  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_LOCK);
  tmpVal = BL_SET_REG_BIT(tmpVal, EF_DATA_0_WR_LOCK_WIFI_MAC);
  BL_WR_REG(EF_DATA_BASE, EF_DATA_0_LOCK, tmpVal);

  if (program) {
    EF_Ctrl_Program_Efuse_0();
  }
}

/****************************************************************************
 * @brief  Whether a value bits is all zero
 *
 * @param  val: value to check
 * @param  start: start bit
 * @param  len: total length of bits to check
 *
 * @return 1 for all bits zero 0 for others
 *
 *******************************************************************************/
uint8_t EF_Ctrl_Is_All_Bits_Zero(uint32_t val, uint8_t start, uint8_t len) {
  uint32_t mask = 0;

  val = (val >> start);

  if (len >= 32) {
    mask = 0xffffffff;
  } else {
    mask = (1 << len) - 1;
  }

  if ((val & mask) == 0) {
    return 1;
  } else {
    return 0;
  }
}

/****************************************************************************
 * @brief  Whether MAC address slot is empty
 *
 * @param  slot: MAC address slot
 * @param  reload: whether  reload to check
 *
 * @return 0 for all slots full,1 for others
 *
 *******************************************************************************/
uint8_t EF_Ctrl_Is_MAC_Address_Slot_Empty(uint8_t slot, uint8_t reload) {
  uint32_t tmp1 = 0xffffffff, tmp2 = 0xffffffff;
  uint32_t part1Empty = 0, part2Empty = 0;

  if (slot == 0) {
    /* Switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_0();

    if (reload) {
      EF_CTRL_LOAD_BEFORE_READ_R0;
    }

