Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_ef_ctrl.c
    tmp1 = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_WIFI_MAC_LOW);
    tmp2 = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_WIFI_MAC_HIGH);
  } else if (slot == 1) {
    /* Switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_0();

    if (reload) {
      EF_CTRL_LOAD_BEFORE_READ_R0;
    }

    tmp1 = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W0);
    tmp2 = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W1);
  } else if (slot == 2) {
    /* Switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_0();

    if (reload) {
      EF_CTRL_LOAD_BEFORE_READ_R0;
    }

    tmp1 = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_DBG_PWD_LOW);
    tmp2 = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_DBG_PWD_HIGH);
  }

  part1Empty = (EF_Ctrl_Is_All_Bits_Zero(tmp1, 0, 32));
  part2Empty = (EF_Ctrl_Is_All_Bits_Zero(tmp2, 0, 22));

  return (part1Empty && part2Empty);
}

/****************************************************************************
 * @brief  Efuse write optional MAC address
 *
 * @param  slot: MAC address slot
 * @param  mac[8]: MAC address buffer
 * @param  program: Whether program
 *
 * @return SUCCESS or ERROR
 *
 *******************************************************************************/
BL_Err_Type EF_Ctrl_Write_MAC_Address_Opt(uint8_t slot, uint8_t mac[8], uint8_t program) {
  uint8_t *maclow  = (uint8_t *)mac;
  uint8_t *machigh = (uint8_t *)(mac + 4);
  uint32_t tmpVal  = 0;
  uint32_t i       = 0;
  uint32_t cnt     = 0;

  if (slot >= 3) {
    return ERROR;
  }

  if (slot == 2) {
    /* Switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_0();
  } else {
    /* Switch to AHB clock */
    EF_Ctrl_Sw_AHB_Clk_0();
  }

  /* The low 32 bits */
  if (slot == 0) {
    BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_WIFI_MAC_LOW, BL_RDWD_FRM_BYTEP(maclow));
  } else if (slot == 1) {
    BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W0, BL_RDWD_FRM_BYTEP(maclow));
  } else if (slot == 2) {
    BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_DBG_PWD_LOW, BL_RDWD_FRM_BYTEP(maclow));
  }

  /* The high 32 bits */
  if (slot == 0) {
    BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_WIFI_MAC_HIGH, BL_RDWD_FRM_BYTEP(machigh));
  } else if (slot == 1) {
    BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W1, BL_RDWD_FRM_BYTEP(machigh));
  } else if (slot == 2) {
    BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_DBG_PWD_HIGH, BL_RDWD_FRM_BYTEP(machigh));
  }

  cnt = 0;
  for (i = 0; i < 8; i++) {
    cnt += EF_Ctrl_Get_Byte_Zero_Cnt(mac[i]);
  }
  cnt &= 0x3f;
  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W2);
  if (slot == 0) {
    tmpVal |= (cnt << 0);
  } else if (slot == 1) {
    tmpVal |= (cnt << 6);
  } else if (slot == 2) {
    tmpVal |= (cnt << 12);
  }
  BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W2, tmpVal);

  if (program) {
    if (slot == 2) {
      EF_Ctrl_Program_Efuse_0();
    } else {
      EF_Ctrl_Program_Efuse_0();
    }
  }
  return SUCCESS;
}

/****************************************************************************
 * @brief  Efuse read optional MAC address
 *
 * @param  slot: MAC address slot
 * @param  mac[8]: MAC address buffer
 * @param  reload: Whether reload
 *
 * @return SUCCESS or ERROR
 *
 *******************************************************************************/
BL_Err_Type EF_Ctrl_Read_MAC_Address_Opt(uint8_t slot, uint8_t mac[8], uint8_t reload) {
  uint8_t *maclow  = (uint8_t *)mac;
  uint8_t *machigh = (uint8_t *)(mac + 4);
  uint32_t tmpVal  = 0;
  uint32_t i       = 0;
  uint32_t cnt     = 0;
  uint32_t crc     = 0;

  if (slot >= 3) {
    return ERROR;
  }

  /* Trigger read data from efuse */
  if (reload) {
    if (slot == 2) {
      EF_CTRL_LOAD_BEFORE_READ_R0;
    } else {
      EF_CTRL_LOAD_BEFORE_READ_R0;
    }
  }

  if (slot == 0) {
    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_WIFI_MAC_LOW);
  } else if (slot == 1) {
    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W0);
  } else if (slot == 2) {
    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_DBG_PWD_LOW);
  }
  BL_WRWD_TO_BYTEP(maclow, tmpVal);

  if (slot == 0) {
    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_WIFI_MAC_HIGH);
  } else if (slot == 1) {
    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W1);
  } else if (slot == 2) {
    tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_DBG_PWD_HIGH);
  }
  BL_WRWD_TO_BYTEP(machigh, tmpVal);

  /* Get original parity */
  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W2);
  if (slot == 0) {
    crc = ((tmpVal >> 0) & 0x3f);
  } else if (slot == 1) {
    crc = ((tmpVal >> 6) & 0x3f);
  } else if (slot == 2) {
    crc = ((tmpVal >> 12) & 0x3f);
  }

  /* Check parity */
  for (i = 0; i < 8; i++) {
    cnt += EF_Ctrl_Get_Byte_Zero_Cnt(mac[i]);
  }
  if ((cnt & 0x3f) == crc) {
    return SUCCESS;
  } else {
    return ERROR;
  }
}

/****************************************************************************
 * @brief  Efuse read chip ID
 *
 * @param  chipID[8]: Chip ID buffer
 *
 * @return SUCCESS or ERROR
 *
 *******************************************************************************/
BL_Err_Type EF_Ctrl_Read_Chip_ID(uint8_t chipID[8]) { return EF_Ctrl_Read_MAC_Address(chipID); }

/****************************************************************************
 * @brief  Efuse get chip PID&&VID
 *
 * @param  pid[1]: Chip PID
 * @param  vid[1]: Chip VID
 *
 * @return SUCCESS or ERROR
 *
 *******************************************************************************/
BL_Err_Type EF_Ctrl_Get_Chip_PIDVID(uint16_t pid[1], uint16_t vid[1]) {
  uint32_t tmpVal;

  /* Trigger read data from efuse */
  EF_CTRL_LOAD_BEFORE_READ_R0;

  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_4_W3);
  pid[0] = (uint16_t)(tmpVal & 0xFFFF);
  vid[0] = (uint16_t)(tmpVal >> 16);

  return SUCCESS;
}

uint64_t EF_Ctrl_Get_Key_Slot_w0w1() {
  uint64_t tmpVal;

  /* Trigger read data from efuse */
  EF_CTRL_LOAD_BEFORE_READ_R0;

  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_4_W0);
  tmpVal |= ((uint64_t)BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_4_W1)) << 32;

