Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_ef_ctrl.c
  return tmpVal;
}

/****************************************************************************
 * @brief  Efuse get customer PID&&VID
 *
 * @param  pid[1]: Customer PID
 * @param  vid[1]: Customer VID
 *
 * @return SUCCESS or ERROR
 *
 *******************************************************************************/
BL_Err_Type EF_Ctrl_Get_Customer_PIDVID(uint16_t pid[1], uint16_t vid[1]) {
  uint32_t tmpVal;

  /* Trigger read data from efuse */
  EF_CTRL_LOAD_BEFORE_READ_R0;

  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_4_W2);
  pid[0] = (uint16_t)(tmpVal & 0xFFFF);
  vid[0] = (uint16_t)(tmpVal >> 16);

  return SUCCESS;
}

/****************************************************************************
 * @brief  Efuse read device info
 *
 * @param  deviceInfo: Device info pointer
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Read_Device_Info(Efuse_Device_Info_Type *deviceInfo) {
  uint32_t  tmpVal;
  uint32_t *p = (uint32_t *)deviceInfo;

  /* Trigger read data from efuse */
  EF_CTRL_LOAD_BEFORE_READ_R0;

  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W2);
  *p     = tmpVal;
}

/****************************************************************************
 * @brief  Whether Capcode is empty
 *
 * @param  slot: Cap code slot
 * @param  reload: Whether reload
 *
 * @return 0 for all slots full,1 for others
 *
 *******************************************************************************/
uint8_t EF_Ctrl_Is_CapCode_Empty(uint8_t slot, uint8_t reload) {
  uint32_t tmp = 0xffffffff;

  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  if (reload) {
    EF_CTRL_LOAD_BEFORE_READ_R0;
  }

  if (slot == 0) {
    tmp = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W3);
    return (EF_Ctrl_Is_All_Bits_Zero(tmp, 25, 7));
  } else if (slot == 1) {
    tmp = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3);
    return (EF_Ctrl_Is_All_Bits_Zero(tmp, 9, 7));
  } else if (slot == 2) {
    tmp = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3);
    return (EF_Ctrl_Is_All_Bits_Zero(tmp, 25, 7));
  } else {
    return 0;
  }
}

/****************************************************************************
 * @brief  Efuse write Cap code
 *
 * @param  slot: Cap code slot
 * @param  code: Cap code value
 * @param  program: Whether program
 *
 * @return SUCCESS or ERROR
 *
 *******************************************************************************/
BL_Err_Type EF_Ctrl_Write_CapCode_Opt(uint8_t slot, uint8_t code, uint8_t program) {
  uint32_t tmp;
  uint8_t  trim;

  if (slot >= 3) {
    return ERROR;
  }

  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();
  EF_CTRL_LOAD_BEFORE_READ_R0;

  trim = (code << 1);
  trim |= (1 << 0);

  if (slot == 0) {
    tmp = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W3);
    BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W3, tmp | (trim << 25));
  } else if (slot == 1) {
    tmp = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3);
    BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3, tmp | (trim << 9));
  } else if (slot == 2) {
    tmp = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3);
    BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3, tmp | (trim << 25));
  }

  if (program) {
    EF_Ctrl_Program_Efuse_0();
  }
  while (SET == EF_Ctrl_Busy())
    ;

  return SUCCESS;
}

/****************************************************************************
 * @brief  Efuse read Cap code
 *
 * @param  slot: Cap code slot
 * @param  code: Cap code pointer
 * @param  reload: Whether reload
 *
 * @return SUCCESS or ERROR
 *
 *******************************************************************************/
BL_Err_Type EF_Ctrl_Read_CapCode_Opt(uint8_t slot, uint8_t *code, uint8_t reload) {
  uint32_t tmp;
  uint8_t  trim = 0;

  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  if (reload) {
    EF_CTRL_LOAD_BEFORE_READ_R0;
  }

  if (slot == 0) {
    tmp  = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W3);
    trim = (tmp >> 25) & 0x7f;
  } else if (slot == 1) {
    tmp  = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3);
    trim = (tmp >> 9) & 0x7f;
  } else if (slot == 2) {
    tmp  = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3);
    trim = (tmp >> 25) & 0x7f;
  }

  if (trim & 0x01) {
    *code = trim >> 1;
    return SUCCESS;
  }
  return ERROR;
}

/****************************************************************************
 * @brief  Whether power offset slot is empty
 *
 * @param  slot: Power offset code slot
 * @param  reload: Whether reload
 *
 * @return 0 for all slots full,1 for others
 *
 *******************************************************************************/
uint8_t EF_Ctrl_Is_PowerOffset_Slot_Empty(uint8_t slot, uint8_t reload) {
  uint32_t tmp1       = 0xffffffff;
  uint32_t part1Empty = 0, part2Empty = 0;

  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  if (reload) {
    EF_CTRL_LOAD_BEFORE_READ_R0;
  }

  if (slot == 0) {
    tmp1       = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W3);
    part1Empty = (EF_Ctrl_Is_All_Bits_Zero(tmp1, 16, 9));
    part2Empty = 1;
  } else if (slot == 1) {
    tmp1       = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3);
    part1Empty = (EF_Ctrl_Is_All_Bits_Zero(tmp1, 0, 9));
    part2Empty = 1;
  } else if (slot == 2) {
    tmp1       = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3);
    part1Empty = (EF_Ctrl_Is_All_Bits_Zero(tmp1, 16, 9));
    part2Empty = 1;
  }

  return (part1Empty && part2Empty);
}

/****************************************************************************
 * @brief  Efuse write power offset
 *
 * @param  slot: Power offset slot
 * @param  pwrOffset[2]: Power offset value array
 * @param  program: Whether program
 *
 * @return SUCCESS or ERROR
 *
 *******************************************************************************/
BL_Err_Type EF_Ctrl_Write_PowerOffset_Opt(uint8_t slot, int8_t pwrOffset[2], uint8_t program) {
  uint32_t tmp   = 0;
  uint32_t k     = 0;
  uint32_t Value = 0;

  if (slot >= 3) {
    return ERROR;
  }

  for (k = 0; k < 2; k++) {
    /* Use 4 bits as signed value */
    if (pwrOffset[k] > 7) {
      pwrOffset[k] = 7;
    }
    if (pwrOffset[k] < -8) {
      pwrOffset[k] = -8;
    }
    Value += (uint32_t)(pwrOffset[k] & 0x0f) << (k * 4);
  }

  if (slot == 0) {
    tmp = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W3);
    tmp |= (Value << 17);
    tmp |= (1 << 16);
    BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W3, tmp);
  } else if (slot == 1) {
    tmp = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3);
    tmp |= (Value << 1);
    tmp |= (1 << 0);
    BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3, tmp);
  } else if (slot == 2) {
    tmp = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3);
    tmp |= (Value << 17);
    tmp |= (1 << 16);
    BL_WR_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3, tmp);
  }

