Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_ef_ctrl.c
  if (program) {
    EF_Ctrl_Program_Efuse_0();
  }

  while (SET == EF_Ctrl_Busy())
    ;

  return SUCCESS;
}

/****************************************************************************
 * @brief  Efuse read poweroffset value
 *
 * @param  slot: Power offset slot
 * @param  pwrOffset[2]: Power offset array
 * @param  reload: Whether reload
 *
 * @return SUCCESS or ERROR
 *
 *******************************************************************************/
BL_Err_Type EF_Ctrl_Read_PowerOffset_Opt(uint8_t slot, int8_t pwrOffset[2], uint8_t reload) {
  uint32_t pwrOffsetValue = 0;
  uint32_t tmp            = 0, k;
  uint8_t  en             = 0;

  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  if (reload) {
    EF_CTRL_LOAD_BEFORE_READ_R0;
  }

  if (slot == 0) {
    tmp            = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_5_W3);
    en             = (tmp >> 16) & 0x01;
    pwrOffsetValue = (tmp >> 17) & 0xff;
  } else if (slot == 1) {
    tmp            = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3);
    en             = (tmp >> 0) & 0x01;
    pwrOffsetValue = (tmp >> 1) & 0xff;
  } else if (slot == 2) {
    tmp            = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_EF_KEY_SLOT_3_W3);
    en             = (tmp >> 16) & 0x01;
    pwrOffsetValue = (tmp >> 17) & 0xff;
  }

  if (en) {
    for (k = 0; k < 2; k++) {
      tmp = (pwrOffsetValue >> (k * 4)) & 0x0f;
      if (tmp >= 8) {
        pwrOffset[k] = tmp - 16;
      } else {
        pwrOffset[k] = tmp;
      }
    }
    return SUCCESS;
  }
  return ERROR;
}

/****************************************************************************
 * @brief  Efuse write AES key
 *
 * @param  index: index of key slot
 * @param  keyData: key data buffer
 * @param  len: key data length in words
 * @param  program: program to efuse entity or not
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Write_AES_Key(uint8_t index, uint32_t *keyData, uint32_t len, uint8_t program) {
  uint32_t *pAESKeyStart0 = (uint32_t *)(EF_DATA_BASE + 0x1C);

  if (index > 5) {
    return;
  }

  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  /* Every key is 4 words len*/
  BL702_MemCpy4(pAESKeyStart0 + index * 4, keyData, len);

  if (program) {
    EF_Ctrl_Program_Efuse_0();
  }
}

/****************************************************************************
 * @brief  Efuse read AES key from specified region and index
 *
 * @param  index: index of key slot
 * @param  keyData: key data buffer
 * @param  len: key data length in words
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Read_AES_Key(uint8_t index, uint32_t *keyData, uint32_t len) {
  uint32_t *pAESKeyStart0 = (uint32_t *)(EF_DATA_BASE + 0x1C);

  if (index > 5) {
    return;
  }

  /* Trigger read data from efuse*/
  EF_CTRL_LOAD_BEFORE_READ_R0;

  /* Every key is 4 words len*/
  BL702_MemCpy4(keyData, pAESKeyStart0 + index * 4, len);
}

/****************************************************************************
 * @brief  Efuse lock writing for aes key
 *
 * @param  index: index of key slot
 * @param  program: program to efuse entity or not
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Writelock_AES_Key(uint8_t index, uint8_t program) {
  uint32_t tmpVal;

  if (index > 5) {
    return;
  }

  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_LOCK);

  if (index <= 3) {
    tmpVal |= (1 << (index + 19));
  } else {
    tmpVal |= (1 << (index + 19));
    tmpVal |= (1 << (index - 4 + 13));
  }

  BL_WR_REG(EF_DATA_BASE, EF_DATA_0_LOCK, tmpVal);

  if (program) {
    EF_Ctrl_Program_Efuse_0();
  }
}

/****************************************************************************
 * @brief  Efuse lock reading for aes key
 *
 * @param  index: index of key slot
 * @param  program: program to efuse entity or not
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Readlock_AES_Key(uint8_t index, uint8_t program) {
  uint32_t tmpVal;

  if (index > 5) {
    return;
  }

  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  tmpVal = BL_RD_REG(EF_DATA_BASE, EF_DATA_0_LOCK);
  tmpVal |= (1 << (index + 26));
  BL_WR_REG(EF_DATA_BASE, EF_DATA_0_LOCK, tmpVal);

  if (program) {
    EF_Ctrl_Program_Efuse_0();
  }
}

/****************************************************************************
 * @brief  Program data to efuse region 0
 *
 * @param  index: index of efuse in word
 * @param  data: data buffer
 * @param  len: data length
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Program_Direct_R0(uint32_t index, uint32_t *data, uint32_t len) {
  uint32_t *pEfuseStart0 = (uint32_t *)(EF_DATA_BASE + 0x00);

  /* Switch to AHB clock */
  EF_Ctrl_Sw_AHB_Clk_0();

  /* Add delay for CLK to be stable */
  BL702_Delay_US(4);

  BL702_MemCpy4(pEfuseStart0 + index, data, len);

  EF_Ctrl_Program_Efuse_0();
}

/****************************************************************************
 * @brief  Read data from efuse region 0
 *
 * @param  index: index of efuse in word
 * @param  data: data buffer
 * @param  len: data length
 *
 * @return None
 *
 *******************************************************************************/
void EF_Ctrl_Read_Direct_R0(uint32_t index, uint32_t *data, uint32_t len) {
  uint32_t *pEfuseStart0 = (uint32_t *)(EF_DATA_BASE + 0x00);

  EF_CTRL_LOAD_BEFORE_READ_R0;

  BL702_MemCpy4(data, pEfuseStart0 + index, len);
}

/****************************************************************************
 * @brief  Clear efuse data register
 *
 * @param  index: index of efuse in word
 * @param  len: data length
 *
 * @return None
 *
 *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION EF_Ctrl_Clear(uint32_t index, uint32_t len) {
  uint32_t *pEfuseStart0 = (uint32_t *)(EF_DATA_BASE + 0x00);
  uint32_t  i            = 0;

